<?php

$students = [
    "ИТ20" => [
        "Смирнова Христина Потаповна" => 5,
        "Рогозин Даниил Арсениевич" => 4,
        "Золин Владилен Леонтиевич" => 3,
        "Архаткина Владислава Никитевна" => 3,
        "Мещерякова Мария Елизаровна" => 5,
        "Саврасова Фаина Ивановна" => 3,
        "Хромченко Зинаида Николаевна" => 3,
        "Протасова Майя Леонидовна" => 5
    ],
    "БАП20" => [
        "Ябров Тимур Чеславович" => 4,
        "Белорусов Ефрем Изяславович" => 5,
        "Ягода Назар Прохорович" => 3,
        "Ярилова Розалия Серафимовна" => 4,
        "Нырко Платон Вадимович" => 5,
        "Калинин Агап Моисеевич" => 5,
        "Никифоров Юлиан Прокофиевич" => 3
    ],
    "БАП1320" => [
        "Антонов Антон Антонович" => 4,
        "Кириллов Кирилл Кириллович" => 3
    ],
    "ИТ88" => [
        "Кабо Инна Семеновна" => 5,
        "Бабуркин Дмитрий Грегорьевич" => 4
    ],
    "ПУСТО01" => [
    ]
];

$groupAvgMarks = [];
$badStudents = [];
foreach ($students as $groupName => $members) {
    $average = 0;
    $amountStudents = sizeof($members);
    if ($amountStudents > 0) {
        foreach ($members as $student => $mark) {
            $average += $mark;
            if ($mark < 4) {
                $badStudents[$groupName][] = $student;
            }
        }
        $groupAvgMarks[$groupName] = $average / $amountStudents;
    }
}
arsort($groupAvgMarks);
print_r($groupAvgMarks);

echo "Название группы с самым большим вычисленным значением успеваемости: " .
    array_key_first($groupAvgMarks) . PHP_EOL;
echo "Список на отчисление, в который попадают студенты из любой группы, " .
    "имеющие оценку ниже трёх:\n";
print_r($badStudents);
